// @ts-check

import { PrismaClient } from "@prisma/client";

const prisma = new PrismaClient();

// Check if the database is already seeded
const books = await prisma.book.findMany();
if (books.length > 0) {
  console.warn("Database is already seeded. Exiting...");
  process.exit(0);
}

await prisma.book.createMany({
  data: [
    {
      title: "สถาปัตยกรรมคอมพิวเตอร์ การออกแบบและวิเคราะห์",
      author: "ดร. เกริก ภิรมย์โสภา",
      genre: "คอมพิวเตอร์",
      description: "สถาปัตยกรรมคอมพิวเตอร์ การออกแบบและวิเคราะห์",
      isbn: "9786164681156",
      pages: 217,
      coverImageUrl: "/images/krerk-csa-book.jpg",
    },
    {
      title: "人妻教師が教え子の女子高生にドはまりする話",
      author: "入間 人間",
      genre: "Girls Love",
      description: `「そんな優しいとさ、せんせぇのこと好きになっちゃうよっ」

苺原樹――年齢は二十代後半。既婚者。職業は高校教師。そんな私が、10歳年下の教え子の女子高生に手を出してしまった。
生徒の名前は戸川凛。私より背が高くて、温和でどこか幼くて、顔がいい。そしてとてもいい子。家庭環境に問題のあった彼女を気にかけているうちに、いつしかベッドの上で唇を重ねていた。
これは間違いなく裏切りで不倫で犯罪で。身の破滅を招き寄せる要素を、よくもこれだけ集めて。
――なぜこんなことになってしまったんだろう。
淫らで不貞で、でもどこかあたたかい。女教師と女子生徒の恋愛小説`,
      isbn: "978-4049158069",
      pages: 328,
      coverImageUrl: "/hitozuma-1.jpg",
    },
    {
      title: "人妻教師が教え子の女子高生にドはまりする話2",
      author: "入間 人間",
      genre: "Girls Love",
      description: `「でも、今日はせんせぇが悪いよね」

こんにちは! 私淫行教師の苺原樹! 十歳年下の教え子と関係を結んで平気な顔で教壇に立っているどうしようもないやつだよ!
……そう、私は教師失格で反社会的人物で犯罪者で、夫を裏切り幸せを噛みしめている最低の妻。それでも、後悔自体は一切ない。戸川さんに会ってから、私は私の望む道を選んだ。いずれ必ず訪れる破滅を前にしても、この子を守りたい、傷つけさせたくない。私以外のありとあらゆるものから、触れさせたくない。
―ー道を踏み外した理由は、好きな人ができたから。
欲望にまみれて破滅的で、でもどこまでも優しい。女教師と女子生徒の恋愛小説、第二弾。`,
      isbn: "978-4049160918",
      pages: 246,
      coverImageUrl: "/hitozuma-2.jpg",
    },
    {
      title: "AI ที่มีหัวใจ The Ethical Algorithm",
      author:
        "ไมเคิล เคินส์ และ แอรอน รอท (Michael Kearns and Aaron Roth) / ผู้ช่วยศาสตราจารย์ ดร. จิตร์ทัศน์ ฝักเจริญผล",
      genre: "คอมพิวเตอร์",
      description: `ทำไม AI ต้องมีหัวใจ?

จะเป็นอย่างไรหากอัลกอรึทึมของกูเกิลเผยแพร่แนวคิดเหยียดเพศโดยไม่ได้ตั้งใจ เช่น ผลการค้นหาคำว่า สุภาพสตรี มีความสัมพันธ์กับคำว่า ต่างหู ในขณะที่คำว่า หลานชาย มีความสัมพันธ์กับคำว่า อัจฉริยะ หรือบริษัทเทคโนโลยียักษ์ใหญ่อย่างอะเมซอนอาจด้อยค่าความสามารถของผู้หญิงโดยไม่รู้ตัว เช่น AI ที่ใช้คัดกรองผู้สมัครงานของอะเมซอนจะหักคะแนนเรซูเมใดก็ตามที่มีคำว่า ผู้หญิง

ทุกวันนี้เราต่างประจักษ์ถึงความปราดเปรื่องของ AI ว่าสามารถประมวลผลคิด และวิเคราะห์ข้อมูลมหาศาลได้อย่างแม่นยำ แต่บางครั้งผลลัพธ์ที่ได้นั้นก็ยังห่างไกลจากคำว่าเที่ยงธรรมและที่แย่ไปกว่านั้นคือแฝงไปด้วยอคติ

AI ที่มีหัวใจ เล่มนี้จะแสดงถึงความจำเป็น และแนวทางพัฒนาปรับปรุงศาสตร์การออกแบบอัลกอริทึมให้ใส่ใจคุณค่าทางสังคมมากยิ่งขึ้น`,
      isbn: "9786168266403",
      pages: 296,
      coverImageUrl: "/images/ethical-algo.webp",
    },
    {
      title: "เตรียมสอบความถนัดแพทย์ ฉบับติวพร้อมสอบ กสพท.",
      author: "ปาณัสม์ ชูชีพวัฒนา (พี่แมทธิว) และคณะ",
      genre: "คู่มือเตรียมสอบ",
      description: `สรุปเนื้อหาเพื่อเตรียมความพร้อมสำหรับผู้เข้าสอบความถนัดทางแพทย์
ประกอบไปด้วยส่วนคิดด้วยเชาวน์ จริยธรรมทางการแพทย์ และส่วนเชื่อมโยง
พร้อมแนวข้อสอบเสมือนจริงมีเฉลยละเอียดเขียนโดยผู้มีประสบการณ์จากสนามสอบตัวจริง
พร้อมแนะเทคนิคการทำข้อสอบให้ได้คะแนนสูงในเวลาจำกัด`,
      isbn: "9786162369025",
      pages: 301,
      coverImageUrl: "/images/pid-13884.jpg",
    },
    {
      title: "การออกแบบและวิเคราะห์อัลกอริทึม",
      author: "สมชาย ประสิทธิ์จูตระกูล",
      genre: "คอมพิวเตอร์",
      description: `อัลกอริทึม คือ ขั้นตอนวิธีการแก้ไขปัญหาด้วยคอมพิวเตอร์ อันเป็นแนวคิดการแก้ปัญหาของผู้ออกแบบที่นำมาแปลงเป็นฮาร์ดแวร์หรือซอฟต์แวร์ อัลกอริทึมจึงเป็นศาสตร์ที่มีบทบาทสำคัญมากในการศึกษาทางวิทยาการและวิศวกรรมคอมพิวเตอร์ หนังสือเล่มนี้นำเสนอกลวิธีมาตรฐานต่าง ๆ ในการออกแบบและการวิเคราะห์อัลกอริทึม พร้อมกับการจำแนกความยากง่ายของปัญหา ตัวอย่าง และแบบฝึกหัด โดยมีจุดประสงค์หลักเพื่อให้ผู้อ่านสามารถออกแบบอัลกอริทึมที่มีประสิทธิภาพเพื่อแก้ไขปัญหาที่ได้รับ`,
      isbn: "9786165511940",
      pages: 384,
      coverImageUrl: "/images/somchai-algo.jpg",
    },
  ],
});
